//=====================================================================================================================
// Проект: CubeXPlatform
// Раздел: Модуль паттернов
// Подраздел: Подсистема презентации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXPatternPresentCommon.cs
*		Общие типы и структуры данных подсистемы презентации.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.ComponentModel;
//=====================================================================================================================
namespace CubeX
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup CorePatternPresent Подсистема презентации
		//! Подсистема презентации обеспечивает единый механизм представления документа/объекта исходя из его форматов
		//! представления.
		//! \ingroup CorePattern
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Тип презентации данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TPresentType
		{
			/// <summary>
			/// Текстовый документ
			/// </summary>
			Text,

			/// <summary>
			/// Табличное представление данных
			/// </summary>
			Table,

			/// <summary>
			/// Изображение
			/// </summary>
			Image,

			/// <summary>
			/// Представление данных в виде карты
			/// </summary>
			Map,

			/// <summary>
			/// Специальное представление
			/// </summary>
			Special
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для поддержки представления определённой сущностью
		/// </summary>
		/// <remarks>
		/// Интерфейс определяет как будет отображаться определённая сущность (модель, документ или репозиторий)
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public interface ICubeXPresentEntity
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Тип презентации данных
			/// </summary>
			TPresentType PresentType { get; }
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Загрузка данных для отображения в указанный элемент управления
			/// </summary>
			/// <param name="ui_element">Элемент управления для отображения данных</param>
			//---------------------------------------------------------------------------------------------------------
			void LoadPresentData(System.Object ui_element);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Выгрузка данных отображения из указанного элемента управления
			/// </summary>
			/// <param name="ui_element">Элемент управления для отображения данных</param>
			//---------------------------------------------------------------------------------------------------------
			void UnloadPresentData(System.Object ui_element);
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================