//=====================================================================================================================
// Проект: CubeXPlatform
// Раздел: Модуль общей функциональности
// Подраздел: Вспомогательные утилиты на основе отдельной панели(окна)
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXViewerZoomContentWindow.cs
*		Редактор для просмотра, масштабирования и панорамирование внутреннего контента.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 23.02.2020
//=====================================================================================================================
#if UNITY_EDITOR
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Linq;
using System.IO;
using UnityEngine;
using UnityEditor;
//---------------------------------------------------------------------------------------------------------------------
using CubeX.Common;
//=====================================================================================================================
//---------------------------------------------------------------------------------------------------------------------
/// <summary>
/// Редактор для просмотра, масштабирования и панорамирование внутреннего контента
/// </summary>
//---------------------------------------------------------------------------------------------------------------------
public class CubeXViewerZoomContentWindow : CubeXUtilityBaseWindow
{
	#region =============================================== СТАТИЧЕСКИЕ МЕТОДЫ ========================================
	//-----------------------------------------------------------------------------------------------------------------
	/// <summary>
	/// Показать окно для просмотра, масштабирования и панорамирование внутреннего контента
	/// </summary>
	//-----------------------------------------------------------------------------------------------------------------
	[MenuItem(XCommonEditorSettings.MenuPathUtility + "Viewer Zoom Content", false, XCommonEditorSettings.MenuOrderUtility + 15)]
	public static void ShowViewerZoomContent()
	{
		var window = GetWindow<CubeXViewerZoomContentWindow>();
		window.titleContent.text = "Viewer Zoom Content";

		window.OnConstruct();
		window.Show();
	}
	#endregion

	#region =============================================== ДАННЫЕ ====================================================
	// Основные данные
	#endregion

	#region =============================================== ОБШИЕ МЕТОДЫ ==============================================
	//-----------------------------------------------------------------------------------------------------------------
	/// <summary>
	/// Конструирование окна
	/// </summary>
	//-----------------------------------------------------------------------------------------------------------------
	public void OnConstruct()
	{
		mIsManager = false;
	}
	#endregion

	#region =============================================== МЕТОДЫ РИСОВАНИЯ ==========================================
	//-----------------------------------------------------------------------------------------------------------------
	/// <summary>
	/// Рисование основной панели
	/// </summary>
	//-----------------------------------------------------------------------------------------------------------------
	public override void DrawContent()
	{
		GUILayout.Box("RectContent", GUILayout.ExpandHeight(true), GUILayout.ExpandWidth(true));
	}
	#endregion
}
//=====================================================================================================================
#endif
//=====================================================================================================================