//=====================================================================================================================
// Проект: CubeXPlatform
// Раздел: Модуль паттернов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXPatternState.cs
*		Интерфейс для представления возможности менять своё поведение в зависимости от своего состояния.
*		Определение концепции интерфейса для представления возможности менять своё поведение в зависимости от своего состояния.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 23.02.2020
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.ComponentModel;
//=====================================================================================================================
namespace CubeX
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup CorePattern Модуль паттернов
		//! Модуль паттернов представляет собой несколько подсистем(паттернов или шаблонов проектирования) имеющих
		//! общие межплатформенное и архитектурное значение: система поведенческих шаблонов, подсистема модели данных, 
		//! подсистема модели иерархических данных, подсистема репозитория, подсистема документа.
		//! \ingroup Basis
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для представления возможности менять поведение объекта в зависимости от состояния объекта
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ICubeXState
		{

		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================