//=====================================================================================================================
// Проект: CubeXPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема поддержки инспектора свойств
// Группа: Атрибуты дополнительного описания поля/свойства объекта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXInspectorDescPropertyOrder.cs
*		Атрибут для определения порядка отображения свойств/полей в инспекторе свойств.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 23.02.2020
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Globalization;
using System.Runtime.CompilerServices;
//=====================================================================================================================
namespace CubeX
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreModuleInspectorDesc
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут для определения порядка отображения свойств/полей в инспекторе свойств
		/// </summary>
		/// <remarks>
		/// Атрибут является эмуляцией одноименного атрибута компонента WPF Toolkit
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
		public sealed class CubeXPropertyOrderAttribute : Attribute
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal Int32 mOrder;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Порядок отображения свойства
			/// </summary>
			public Int32 Order
			{
				get { return mOrder; }
				set { mOrder = value; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="order">Порядок отображения свойства</param>
			//---------------------------------------------------------------------------------------------------------
			public CubeXPropertyOrderAttribute(Int32 order)
			{
				mOrder = order;
			}
			#endregion
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут для автоматического порядка отображения свойств/полей в инспекторе свойств согласно их декларации
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
		public sealed class CubeXAutoOrderAttribute : Attribute
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal Int32 mOrder;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Порядок отображения свойства
			/// </summary>
			public Int32 Order
			{
				get { return mOrder; }
				set { mOrder = value; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="order">Порядок отображения свойства</param>
			//---------------------------------------------------------------------------------------------------------
			public CubeXAutoOrderAttribute([CallerLineNumber] Int32 order = 0)
			{
				mOrder = order;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================