//=====================================================================================================================
// Проект: CubeXPlatform
// Раздел: Модуль базового ядра
// Подраздел: Базовая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXBaseObject.cs
*		Работа с обобщенными и базовыми типами платформы NET.
*		Реализация дополнительных методов работы с обобщенными и базовыми типами платформы NET.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 23.02.2020
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Reflection;
//=====================================================================================================================
namespace CubeX
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreModuleBase
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы применяемые в целом для всех объектов платформы NET.
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XObject
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Обмен значениями двух объектов
			/// </summary>
			/// <typeparam name="TType">Тип объекта</typeparam>
			/// <param name="left">Первое значение</param>
			/// <param name="right">Второе значение</param>
			//---------------------------------------------------------------------------------------------------------
			public static void Swap<TType>(ref TType left, ref TType right)
			{
				TType temp = left;
				left = right;
				right = temp;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Универсальный и безопасный метод сравнение двух объектов
			/// </summary>
			/// <remarks>
			/// Применяется когда неизвестен тип объекта (ссылочный или значение)
			/// </remarks>
			/// <typeparam name="TType">Тип объекта</typeparam>
			/// <param name="left">Объект</param>
			/// <param name="right">Объект</param>
			/// <returns>Статус равенства объектов</returns>
			//---------------------------------------------------------------------------------------------------------
			public static Boolean GenericEquals<TType>(ref TType left, ref TType right)
			{
				if (typeof(TType).IsValueType)
				{
					return (left.Equals(right));
				}
				else
				{
					if (left != null)
					{
						return (left.Equals(right));
					}
					else
					{
						if (right != null)
						{
							return (right.Equals(left));
						}
					}
				}

				return (true);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Универсальный и безопасный метод сравнение двух объектов ссылочного типа
			/// </summary>
			/// <param name="left">Объект</param>
			/// <param name="right">Объект</param>
			/// <returns>Статус равенства объектов</returns>
			//---------------------------------------------------------------------------------------------------------
			public static Boolean ObjectEquals(System.Object left, System.Object right)
			{
				if (left != null)
				{
					return (left.Equals(right));
				}
				else
				{
					if (right != null)
					{
						return (right.Equals(left));
					}
				}

				return (true);
			}
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий дополнительные методы для работы с типом <see cref="Boolean"/>
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XBoolean
		{
			/// <summary>
			/// Текстовые значение логического типа которые означает истинное значение
			/// </summary>
			public static readonly String[] TrueValues = new String[]
			{
				"True",
				"true",
				"1",
				"on",
				"On",
				"истина",
				"Истина",
				"да",
				"Да"
			};

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Преобразование текста в логическое значение
			/// </summary>
			/// <param name="text">Текст</param>
			/// <returns>Значение</returns>
			//---------------------------------------------------------------------------------------------------------
			public static Boolean Parse(String text)
			{
				return (Array.IndexOf(TrueValues, text) > -1);
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================