//=====================================================================================================================
// Проект: CubeXPlatform
// Раздел: Модуль математической системы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXMathSettings.cs
*		Настройки модуля математической системы применительно к режиму разработки и редактору Unity.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 23.02.2020
//=====================================================================================================================
using System;
using System.Runtime.CompilerServices;
//---------------------------------------------------------------------------------------------------------------------
using CubeX.Core;
//=====================================================================================================================
namespace CubeX
{
	namespace Maths
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Math
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения настроек модуля математической системы применительно к режиму разработки и редактору Unity
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XMathEditorSettings
		{
			/// <summary>
			/// Относительный путь директории исходного кода модуля математической системы
			/// </summary>
			public const String SourcePath = XEditorSettings.SourceBasisPath + "Math/";

			/// <summary>
			/// Путь в размещении меню редактора модуля математической системы (для упорядочивания)
			/// </summary>
			public const String MenuPath = XEditorSettings.MenuPlace + "Math/";
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================