//=====================================================================================================================
// Проект: CubeXPlatform
// Раздел: Модуль паттернов
// Подраздел: Подсистема файловой системы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXFileSystemEntity.cs
*		Общие типы и структуры данных файловой подсистемы.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.IO;
using System.Linq;
//=====================================================================================================================
namespace CubeX
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup CorePatternFileSystem Подсистема файловой системы
		//! Подсистема файловой системы реализует концепцию элементов файловой системы как иерархическую модель данных
		//! \ingroup CorePattern
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс представляющий собой базовую сущность элемента файловой системы
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ICubeXFileSystemEntity : ICubeXModel
		{
			/// <summary>
			/// Полное имя(полный путь) элемента файловой системы
			/// </summary>
			String FullName { get; }
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================