//=====================================================================================================================
// Проект: CubeXPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема единиц измерения
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXUnitMeasurementUnitArea.cs
*		Определение основных единиц измерения площади.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 23.02.2020
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
//=====================================================================================================================
namespace CubeX
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreModuleUnitMeasurement
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Единица измерения площади
		/// </summary>
		/// <remarks>
		/// Значение 1 соответствуют единицы измерения по умолчанию коротая принята в СИ
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TUnitArea
		{
			/// <summary>
			/// Не определена
			/// </summary>
			[CubeXAbbreviation("неоп")]
			Undefined = 0,

			/// <summary>
			/// Квадратный метр
			/// </summary>
			[CubeXAbbreviation("м2")]
			SquareMeter = 1,

			/// <summary>
			/// Квадратный микрометр
			/// </summary>
			[CubeXAbbreviation("мкм2")]
			SquareMicrometer,

			/// <summary>
			/// Квадратный миллиметр
			/// </summary>
			[CubeXAbbreviation("мм2")]
			SquareMillimeter,

			/// <summary>
			/// Квадратный сантиметр
			/// </summary>
			[CubeXAbbreviation("см2")]
			SquareCentimeter,

			/// <summary>
			/// Квадратный дюйм
			/// </summary>
			[CubeXAbbreviation("in2")]
			SquareInch,

			/// <summary>
			/// Квадратный дециметр
			/// </summary>
			[CubeXAbbreviation("дм2")]
			SquareDecimeter,

			/// <summary>
			/// Квадратный фут
			/// </summary>
			[CubeXAbbreviation("ft2")]
			SquareFoot,

			/// <summary>
			/// Квадратный ярд
			/// </summary>
			[CubeXAbbreviation("yard2")]
			SquareYard,

			/// <summary>
			/// Акр
			/// </summary>
			[CubeXAbbreviation("ac")]
			Acre,

			/// <summary>
			/// Гектар
			/// </summary>
			[CubeXAbbreviation("га")]
			Hectare,

			/// <summary>
			/// Квадратный километр
			/// </summary>
			[CubeXAbbreviation("км2")]
			SquareKilometer,
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================