//=====================================================================================================================
// Проект: CubeXPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема единиц измерения
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXUnitMeasurementUnitLength.cs
*		Определение основных единиц измерения длины.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 23.02.2020
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
//=====================================================================================================================
namespace CubeX
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreModuleUnitMeasurement
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Единица измерения длины
		/// </summary>
		/// <remarks>
		/// Значение 1 соответствуют единицы измерения по умолчанию коротая принята в СИ
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TUnitLength
		{
			/// <summary>
			/// Не определена
			/// </summary>
			[CubeXAbbreviation("неоп")]
			Undefined = 0,

			/// <summary>
			/// Метр
			/// </summary>
			[CubeXAbbreviation("м")]
			Meter = 1,

			/// <summary>
			/// Нанометр
			/// </summary>
			[CubeXAbbreviation("нм")]
			Nanometer,

			/// <summary>
			/// Микрометр
			/// </summary>
			[CubeXAbbreviation("мкм")]
			Micrometer,

			/// <summary>
			/// Миллиметр
			/// </summary>
			[CubeXAbbreviation("мм")]
			Millimeter,

			/// <summary>
			/// Сантиметр
			/// </summary>
			[CubeXAbbreviation("см")]
			Centimeter,

			/// <summary>
			/// Дюйм
			/// </summary>
			[CubeXAbbreviation("in")]
			Inch,

			/// <summary>
			/// Дециметр
			/// </summary>
			[CubeXAbbreviation("дм")]
			Decimeter,

			/// <summary>
			/// Фут
			/// </summary>
			[CubeXAbbreviation("ft")]
			Foot,

			/// <summary>
			/// Ярд
			/// </summary>
			[CubeXAbbreviation("yard")]
			Yard,

			/// <summary>
			/// Километр
			/// </summary>
			[CubeXAbbreviation("км")]
			Kilometer,
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================