//=====================================================================================================================
// Проект: CubeXPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема поддержки инспектора свойств
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file CubeXInspectorSupport.cs
*		Определение интерфейсов для расширенной поддержки просмотра и редактирования объекта через инспектор свойств.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.ComponentModel;
using System.Reflection;
//=====================================================================================================================
namespace CubeX
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreModuleInspector
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения просмотра общей информации объекта в инспекторе свойств
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ICubeXSupportViewInspector
		{
			/// <summary>
			/// Отображаемое имя типа в инспекторе свойств
			/// </summary>
			String InspectorTypeName { get; }

			/// <summary>
			/// Отображаемое имя объекта в инспекторе свойств
			/// </summary>
			String InspectorObjectName { get; }
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения расширенной поддержки редактирования объекта в инспекторе свойств
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ICubeXSupportEditInspector : ICubeXSupportViewInspector
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получить массив описателей свойств объекта
			/// </summary>
			/// <returns>Массив описателей</returns>
			//---------------------------------------------------------------------------------------------------------
			CPropertyDesc[] GetPropertiesDesc();
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================